MyHome/src/Catalogs/КошелькиИСчета/КошелькиИСчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КошелькиИСчета</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ТипСчета</name>
    <type>
      <types>EnumRef.ТипыКошельковИСчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КредитныйЛимит</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

MyHome/src/AccumulationRegisters/ДвиженияДенежныхСредств/ДвиженияДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДвиженияДенежныхСредств</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбойЗнак</types>
    </type>
  </resources>
  <dimensions>
    <name>Кошелек</name>
    <type>
      <types>CatalogRef.КошелькиИСчета</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

MyHome/src/Catalogs/КошелькиИСчета/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция ОстатокКошелька(Кошелек, Период = Неопределено) Экспорт

	Если Период = Неопределено Тогда
		ДатаСреза = ТекущаяДата();
	Иначе
		ДатаСреза = Период;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.УстановитьПараметр("Кошелек", Кошелек);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДвиженияДенежныхСредствОстатки.СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ДвиженияДенежныхСредств.Остатки(&ДатаСреза, Кошелек = &Кошелек) КАК ДвиженияДенежныхСредствОстатки";

	Выборка = Запрос.Выполнить().Выбрать();

	Баланс = 0;

	Если Выборка.Следующий() Тогда
		Баланс = Выборка.СуммаОстаток;
	КонецЕсли;

	Возврат Баланс;

КонецФункции

Функция ОстаткиКошельков(Кошельки, Период = Неопределено, ВСоответствие = Истина) Экспорт

	Если Период = Неопределено Тогда
		ДатаСреза = ТекущаяДата();
	Иначе
		ДатаСреза = Период;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.УстановитьПараметр("Кошельки", Кошельки);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДвиженияДенежныхСредствОстатки.Кошелек,
	|	ДвиженияДенежныхСредствОстатки.СуммаОстаток КАК Баланс
	|ИЗ
	|	РегистрНакопления.ДвиженияДенежныхСредств.Остатки(&ДатаСреза, Кошелек В (&Кошельки)) КАК
	|		ДвиженияДенежныхСредствОстатки";

	ТаблицаДанных = Запрос.Выполнить().Выгрузить();

	Результат = ТаблицаДанных;

	Если ВСоответствие Тогда

		Результат = Новый Соответствие;

		Для Каждого СтрокаТаблицы Из ТаблицаДанных Цикл
			Результат.Вставить(СтрокаТаблицы.Кошелек, СтрокаТаблицы.Баланс);
		КонецЦикла;

	КонецЕсли;

	Возврат Результат;

КонецФункции

Функция КошелькиДляОтображенияНаРабочемСтоле() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КошелькиИСчета.Ссылка КАК Кошелек
	|ИЗ
	|	Справочник.КошелькиИСчета КАК КошелькиИСчета
	|ГДЕ
	|	НЕ КошелькиИСчета.ПометкаУдаления
	|	И КошелькиИСчета.ОтображатьОстатокНаРабочемСтоле";

	Кошельки = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Кошелек");

	Возврат Кошельки;

КонецФункции

#КонецОбласти
